Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.130/PIC32CK-SG00/atdf/PIC32CK0512SG00100.atdf
        <module name="PTC" id="03721" name2="afe_ptc_ctrl_u2215_v6" version="6a0">
          <instance name="PTC">
            <register-group name="PTC" name-in-module="PTC" address-space="base" offset="0x45014000"/>
            <signals>
              <signal group="DRV" index="0" function="N" pad="PA09"/>
              <signal group="DRV" index="1" function="N" pad="PA10"/>
              <signal group="DRV" index="2" function="N" pad="PA11"/>
              <signal group="DRV" index="3" function="N" pad="PA12"/>
              <signal group="DRV" index="4" function="N" pad="PB00"/>
              <signal group="DRV" index="5" function="N" pad="PB01"/>
              <signal group="DRV" index="6" function="N" pad="PB07"/>
              <signal group="DRV" index="7" function="N" pad="PB08"/>
              <signal group="DRV" index="8" function="N" pad="PB09"/>
              <signal group="DRV" index="9" function="N" pad="PB10"/>
              <signal group="DRV" index="10" function="N" pad="PC00"/>
              <signal group="DRV" index="11" function="N" pad="PC01"/>
              <signal group="DRV" index="12" function="N" pad="PC02"/>
              <signal group="DRV" index="13" function="N" pad="PC03"/>
              <signal group="DRV" index="14" function="N" pad="PC04"/>
              <signal group="DRV" index="15" function="N" pad="PC05"/>
              <signal group="DRV" index="16" function="N" pad="PC06"/>
              <signal group="DRV" index="17" function="N" pad="PC07"/>
              <signal group="DRV" index="18" function="N" pad="PC13"/>
              <signal group="DRV" index="19" function="N" pad="PC09"/>
              <signal group="DRV" index="20" function="N" pad="PC10"/>
              <signal group="DRV" index="21" function="N" pad="PC11"/>
              <signal group="DRV" index="22" function="N" pad="PC12"/>
              <signal group="DRV" index="23" function="N" pad="PC20"/>
              <signal group="DRV" index="24" function="N" pad="PB16"/>
              <signal group="DRV" index="25" function="N" pad="PB17"/>
              <signal group="DRV" index="26" function="N" pad="PC14"/>
              <signal group="DRV" index="27" function="N" pad="PC15"/>
              <signal group="DRV" index="28" function="N" pad="PC16"/>
              <signal group="DRV" index="29" function="N" pad="PC17"/>
              <signal group="DRV" index="30" function="N" pad="PC18"/>
              <signal group="DRV" index="31" function="N" pad="PC19"/>
              <signal group="ECI" index="0" function="N" pad="PA18"/>
              <signal group="ECI" index="1" function="N" pad="PA19"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_EOC" value="64" caption="Index of DMA EOC trigger"/>
              <param name="DMAC_ID_SEQ" value="62" caption="Index of DMA SEQ trigger"/>
              <param name="DMAC_ID_WCOMP" value="63" caption="Index of DMA WCOMP trigger"/>
              <param name="GCLK_ID" value="35" caption="Index of Generic Clock"/>
              <param name="LINES_NUM" value="32" caption="Number of PTC lines"/>
              <param name="INSTANCE_ID" value="74" caption="Instance index for PTC"/>
              <param name="MCLK_ID_APB" value="106" caption="Index for PTC APB clock"/>
              <param name="PAC_ID" value="74" caption="Index for PTC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="RSTC" id="03926" name2="pwr_rpmu_rstc_v1" version="1b0">
          <instance name="RSTC">
            <register-group name="RSTC" name-in-module="RSTC" address-space="base" offset="0x4400A000"/>
            <parameters>
              <param name="BACKUP_IMPLEMENTED" value="1"/>
              <param name="CM_DBGRESET_STRETCHED" value="3" caption="Reset stretcher size for Cortex CPU related to DBGRESET."/>
              <param name="CM_HRESET_N_STRETCHED" value="3" caption="Reset stretcher size for Cortex CPU related to HRESETn."/>
              <param name="CM_PORESET_STRETCHED" value="3" caption="Reset stretcher size for Cortex CPU related to PORESET."/>
              <param name="HIB_IMPLEMENTED" value="1"/>
              <param name="VBAT_IMPLEMENTED" value="1" caption="One if VBAT (Battery backup mode) is supported"/>
              <param name="INSTANCE_ID" value="5" caption="Instance index for RSTC"/>
              <param name="MCLK_ID_APB" value="37" caption="Index for RSTC APB clock"/>
              <param name="PAC_ID" value="5" caption="Index for RSTC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="03608" name2="tmr_rtc_u2250_v3" version="3b0">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x44018000"/>
            <signals>
              <signal group="IN" index="0" function="RTC_IN" pad="PB06"/>
              <signal group="IN" index="1" function="RTC_IN" pad="PB01"/>
              <signal group="IN" index="2" function="RTC_IN" pad="PB14"/>
              <signal group="IN" index="3" function="RTC_IN" pad="PB15"/>
              <signal group="IN" index="4" function="RTC_IN" pad="PB13"/>
              <signal group="OUT" index="0" function="RTC_OUT" pad="PB05"/>
              <signal group="OUT" index="1" function="RTC_OUT" pad="PB00"/>
              <signal group="OUT" index="2" function="RTC_OUT" pad="PB11"/>
              <signal group="OUT" index="3" function="RTC_OUT" pad="PB12"/>
              <signal group="OUT" index="4" function="RTC_OUT" pad="PB16"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TIMESTAMP" value="4" caption="DMA RTC timestamp trigger"/>
              <param name="NUM_OF_ALARMS" value="2" caption="Number of Alarms"/>
              <param name="NUM_OF_BKREGS" value="0" caption="Number of Backup Registers"/>
              <param name="NUM_OF_COMP16" value="4" caption="Number of 16-bit Comparators"/>
              <param name="NUM_OF_TAMPERS" value="8" caption="Number of Tamper Inputs"/>
              <param name="INSTANCE_ID" value="12" caption="Instance index for RTC"/>
              <param name="MCLK_ID_APB" value="44" caption="Index for RTC APB clock"/>
              <param name="PAC_ID" value="12" caption="Index for RTC registers write protection"/>
            </parameters>
          </instance>
        </module>
