Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.130/PIC32CK-SG00/atdf/PIC32CK0512SG00100.atdf
        <register name="CELOCK_TZ1_CE_NS" offset="0x30" rw="RW" size="4" access-size="4" count="4" caption="Chip Erase Lock for TZ1_NS">
        </register>
        <register name="KEYVAL_TZ1_CE_S" offset="0x40" rw="RW" size="4" access-size="4" count="4" caption="Chip Erase Key for TZ1_S">
        </register>
        <register name="CELOCK_TZ1_CE_S" offset="0x50" rw="RW" size="4" access-size="4" count="4" caption="Chip Erase Lock for TZ1_S">
        </register>
        <register name="KEYVAL_TZ1_CE_ALL" offset="0x60" rw="RW" size="4" access-size="4" count="4" caption="Chip Erase Key for TZ1_ALL">
        </register>
        <register name="CELOCK_TZ1_CE_ALL" offset="0x70" rw="RW" size="4" access-size="4" count="4" caption="Chip Erase Lock for TZ1_ALL">
        </register>
        <register name="KEYVAL_TZ0_CE_ALL" offset="0x80" rw="RW" size="4" access-size="4" count="4" caption="Chip Erase Key for TZ0_ALL">
        </register>
        <register name="CELOCK_TZ0_CE_ALL" offset="0x90" rw="RW" size="4" access-size="4" count="4" caption="Chip Erase Lock for TZ0_ALL">
        </register>
        <register name="KEYVAL_CRCCMD" offset="0xA0" rw="RW" size="4" access-size="4" count="4" caption="CRC Access Key">
        </register>
        <register name="KEYCONFIG_CRCCMD" offset="0xB0" rw="RW" size="4" access-size="4" count="4" caption="CRC Access Key Configuration">
        </register>
        <register name="KEYVAL_HOSTDALELEV" offset="0xC0" rw="RW" size="4" access-size="4" count="4" caption="Host Authenticated DAL Elevation Key">
        </register>
        <register name="KEYCONFIG_HOSTDALELEV" offset="0xD0" rw="RW" size="4" access-size="4" count="4" caption="Host Authenticated DAL Elevation Key Configuration">
        </register>
        <register name="ROM_CTRLA" offset="0xE0" rw="RW" size="4" access-size="4" caption="ROM CTRLA Settings  (BROM_PLLEN must be set)">
        </register>
        <register name="FCR_CTRLA" offset="0xE4" rw="RW" size="4" access-size="4" caption="FCR CTRLA Settings (BROM_PLLEN must be set)">
        </register>
        <register name="RPMU_VREGCTRL" offset="0xE8" rw="RW" size="4" access-size="4" caption="RPMU VREGCTRL Settings (BROM_PLLEN must be set)">
        </register>
        <register name="PLL0_CTRL" offset="0xEC" rw="RW" size="4" access-size="4" caption="PLL0 CTRL Settings (BROM_PLLEN must be set)">
        </register>
        <register name="PLL0_FBDIV" offset="0xF0" rw="RW" size="4" access-size="4" caption="PLL0 FBDIV Settings (BROM_PLLEN must be set)">
        </register>
        <register name="PLL0_REFDIV" offset="0xF4" rw="RW" size="4" access-size="4" caption="PLL0 REFDIV Settings (BROM_PLLEN must be set)">
        </register>
        <register name="PLL0_POSTDIVA" offset="0xF8" rw="RW" size="4" access-size="4" caption="PLL0 POSTDIVA Settings (BROM_PLLEN must be set)">
        </register>
        <register name="MCLK_CLKDIV1" offset="0xFC" rw="RW" size="4" access-size="4" caption="MCLK CLKDIV1 Settings (BROM_PLLEN must be set)">
        </register>
        <register name="GCLK_GENCTRL0" offset="0x100" rw="RW" size="4" access-size="4" caption="GCLK GENCTRL0 Settings (BROM_PLLEN must be set)">
        </register>
        <register name="BROM_BOOTCFGCRC" offset="0x110" rw="RW" size="4" access-size="4" count="4" caption="Boot Configuraiton Page CRC">
        </register>
        <register name="BROM_PAGEEND" offset="0x120" rw="RW" size="4" access-size="4" caption="Page End Marker for Verified Data">
        </register>
      </register-group>
      <register-group name="FUSES_DALCFG" caption="Defines FUSE parameters">
        <register name="DAL" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Debug Access Level">
          <bitfield name="CPU0" caption="Host DAL Elevation Value" mask="0xFF" values="DAL__CPU0"/>
          <bitfield name="CPU1" caption="HSM DAL Elevation Value" mask="0xFF00" values="DAL__CPU1"/>
        </register>
      </register-group>
      <register-group name="FUSES_USERCFG1" caption="Defines FUSE parameters">
        <register name="FSEQ" offset="0x0" rw="RW" size="4" access-size="4" count="8" caption="Flash Sequence Number">
          <bitfield name="SEQNUM" caption="Sequence Number" mask="0xFFFF"/>
          <bitfield name="SEQBAR" caption="Sequence Number Bar (Negeated)" mask="0xFFFF0000"/>
        </register>
        <register name="AFSEQ" offset="0x20" rw="RW" size="4" access-size="4" count="8" caption="Alternate Flash Sequence Number">
          <bitfield name="ASEQNUM" caption="Alternate Sequence Number" mask="0xFFFF"/>
          <bitfield name="ASEQBAR" caption="Alternate Sequence Number Bar (Negeated)" mask="0xFFFF0000"/>
        </register>
        <register name="FUCFG0" offset="0x40" rw="RW" size="4" access-size="4" caption="WDT Configuration">
          <bitfield name="WDT_ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="WDT_WEN" caption="Window Mode Enable" mask="0x4"/>
          <bitfield name="WDT_RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="WDT_ALWAYSON" caption="Always On" mask="0x80"/>
          <bitfield name="WDT_PER" caption="Time-out Period" mask="0xF00"/>
          <bitfield name="WDT_WINDOW" caption="Window Mode Time-out Period" mask="0xF000"/>
          <bitfield name="WDT_EWOFFSET" caption="Early Warning Interrupt Time Offset" mask="0xF0000"/>
        </register>
        <register name="FUCFG1" offset="0x44" rw="RW" size="4" access-size="4" caption="User Configuration 1 (System Bus Configuration)">
        </register>
        <register name="FUCFG2" offset="0x48" rw="RW" size="4" access-size="4" caption="User Configuration 2 (Deep Sleep SMOR Configuration)">
          <bitfield name="BRCFGUDSSMOR_BOR_HYST" caption="BOT Trip Hystersis" mask="0x1"/>
          <bitfield name="BRCFGUDSSMOR_BOR_TRIP" caption="BOT Trip Points" mask="0x6"/>
        </register>
        <register name="FUCFG3" offset="0x4C" rw="RW" size="4" access-size="4" caption="User Configuration 2 (SMOR Configuration)">
          <bitfield name="HYST_BOR_VDDIO" caption="BOR Trip Point Hystersis for VDDIO" mask="0x1"/>
          <bitfield name="BOR_TRIP_VDDIO" caption="BOR Trip Points for VDDIO" mask="0x6"/>
          <bitfield name="HYST_BOR_VDDIOB" caption="BOR Trip Point Hystersis for VDDIOB" mask="0x8"/>
          <bitfield name="BOR_TRIP_VDDIOB" caption="BOR Trip Points for VDDIOB" mask="0x30"/>
          <bitfield name="HYST_BOR_VDDA" caption="BOR Trip Point Hystersis for VDDANA" mask="0x40"/>
          <bitfield name="BOR_TRIP_VDDA" caption="BOR Trip Points for VDDANA" mask="0x180"/>
          <bitfield name="HYST_BOR_VDDREG" caption="BOR Trip Point Hystersis for VDDREG" mask="0x400"/>
        </register>
        <register name="FUCFG5" offset="0x54" rw="RW" size="4" access-size="4" initval="0x00000000" caption="User Configuration 5 (VREG Charge Pump Configuration)">
          <bitfield name="UCP0" caption="User charge pump setting" mask="0xF"/>
          <bitfield name="UCP1" caption="User charge pump setting" mask="0xF00"/>
        </register>
        <register name="FUCFG6" offset="0x58" rw="RW" size="4" access-size="4" caption="User Configuration 6 (FCR ECCCTRL Configuration)">
          <bitfield name="PFM_ECCCTL" caption="ECC Mode Control" mask="0x30"/>
          <bitfield name="PFM_ECCUNLCK" caption="ECC Mode Control Unlock" mask="0x40"/>
          <bitfield name="PFM_SECCNT" caption="Flash SEC Count" mask="0xFF00"/>
        </register>
        <register name="FUCFG7" offset="0x5C" rw="RW" size="4" access-size="4" caption="User Configuration 7 (FCR CTRLB Configuration)">
          <bitfield name="PFM_TEMP" caption="NVM Operating Temperature Read Mode" mask="0x2"/>
        </register>
        <register name="FUCFG8" offset="0x60" rw="RW" size="4" access-size="4" caption="User Configuration 8 (FCW CWP Configuration)">
          <bitfield name="PFM_UC1WP" caption="User Configuration Page 1 Write Protect" mask="0x1"/>
          <bitfield name="PFM_UC2WP" caption="User Configuration Page 2 Write Protect" mask="0x100"/>
          <bitfield name="PFM_UC1WPLOCK" caption="User Configuration Page 1 Write Protection Lock" mask="0x10000"/>
          <bitfield name="PFM_UC2WPLOCK" caption="User Configuration Page 2 Write Protection Lock" mask="0x1000000"/>
        </register>
        <register name="FUCFG9" offset="0x64" rw="RW" size="4" access-size="4" caption="User Configuration 9 (RAM BISR and ECC Configuraiton)">
        </register>
